app/Controllers/Artikel.php

SELECT *
FROM `artikel`
SELECT *
FROM `artikel`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `artikel`
---
    public function index()
    {
        $data = [
            'title'   => 'Daftar Artikel',
            'artikel' => $this->artikelModel->paginate(6, 'artikel'),
            'pager'   => $this->artikelModel->pager,
        ];

SELECT *
FROM `artikel`
WHERE `slug` = 'konser-nct-wish-jakarta'
 LIMIT 1
---
    public function view($slug)
    {
        $artikel = $this->artikelModel->where('slug', $slug)->first();

SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`id` DESC
 LIMIT 10
SELECT *
FROM `artikel`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artikel`
---
    public function admin_index()
    {
        $data = [
            'title'   => 'Halaman Admin - Artikel',
            'artikel' => $this->artikelModel->paginate(10, 'artikel'),
            'pager'   => $this->artikelModel->pager
        ];

INSERT INTO `artikel` (`judul`, `isi`, `status`, `gambar`, `slug`) VALUES ('KONSER NCT WISH JAKARTA', ' Boyband asal Korea Selatan, NCT Wish sukses menggelar konser bertajuk NCT WISH 1st CONCERT TOUR ‘INTO THE WISH : Our WISH’ IN JAKARTA. \r\n\r\nArtikel ini telah tayang di Suara.com dengan judul \"NCT Wish Tampil All Out di Konser Jakarta, Panggung Megah dan Aksi Penuh Energi Bikin Fans Histeris\"eris.\r\n        ', '1', '1776152229_16265faebd99081a3ad6.jpg', 'konser-nct-wish-jakarta')
---
    public function add()
    {
        if ($this->request->is('post')) {
            $fileGambar = $this->request->getFile('gambar');
            $namaGambar = null;

            // Jika ada file yang diunggah
            if ($fileGambar && $fileGambar->isValid() && !$fileGambar->hasMoved()) {
                $namaGambar = $fileGambar->getRandomName();
                $fileGambar->move('uploads', $namaGambar);
            }

            $this->artikelModel->save([
                'judul'  => $this->request->getPost('judul'),
                'isi'    => $this->request->getPost('isi'),
                'status' => $this->request->getPost('status') ?? 1,
                'gambar' => $namaGambar,
                'slug'   => url_title($this->request->getPost('judul'), '-', true)
            ]);

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '7'
DELETE FROM `artikel`
WHERE `id` IN ('7')
---
    public function delete($id)
    {
        $artikel = $this->artikelModel->find($id);

        if ($artikel) {
            // Hapus file gambar dari folder uploads
            if ($artikel['gambar'] && file_exists('uploads/' . $artikel['gambar'])) {
                unlink('uploads/' . $artikel['gambar']);
            }

            $this->artikelModel->delete($id);