app/Controllers/Artikel.php

        } else {
            // Jika diakses manual lewat browser, muat halaman beserta daftar kategorinya
            $kategoriModel = new KategoriModel();
            $data['kategori'] = $kategoriModel->findAll();
---
SELECT *
FROM `kategori`